In [21]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.arange(16).reshape(4,4),
             index=['台北','台中','台南', '高雄'],
             columns=['one', 'two', 'three', 'four'])
display(df)

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [22]:
#使用subscript[]選取欄
print(type(df['two']))
df['two']
int(df['two']['台中'])

<class 'pandas.core.series.Series'>

5

In [23]:
int(df.loc['台北']['two'])

1

In [24]:
#使用subscript[[]]
df[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [25]:
#使用loc[[]]
df.loc[['台北','台中']]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [26]:
df.loc[['台北','台中'],['one','two','three']]

    one  two  three
台北    0    1      2
台中    4    5      6

In [27]:
df.iloc[0:2,0:3]

    one  two  three
台北    0    1      2
台中    4    5      6

In [30]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.arange(9).reshape(3,3),
             index=['a','c','d'],
             columns=['台北','台中', '高雄'])
df

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [29]:
display(df.reindex(labels = ['a','c'],axis=0))
df.reindex(labels = ['台北','台中'],axis=1)

   台北  台中  高雄
a   0   1   2
c   3   4   5

   台北  台中
a   0   1
c   3   4
d   6   7

In [31]:
#使用DataFrame.reindex()
display(df.reindex(labels=['a','c'],axis=0))
display(df.reindex(labels=['台北','高雄'],axis=1))

   台北  台中  高雄
a   0   1   2
c   3   4   5

   台北  高雄
a   0   2
c   3   5
d   6   8